# Pandas(Python Data Analysis Library)  
### 시리즈(Series): 일차원 레이블 배열과 같은 구조(인덱스, 데이터 값)
### 데이터프레임(DataFrame): 2차원 배열, n개의 시리즈들의 집합

In [1]:
import pandas as pd

# 투플을 시리즈로 변환(index 옵션에 인덱스 이름을 지정)
tup_data = ('영인', '2010-05-01', '여', True)
sr = pd.Series(tup_data, index=['이름', '생년월일', '성별', '학생여부'])
print(sr,"\n")

# 원소를 1개 선택
print(sr[0],"\n") # sr의 1 번째 원소를 선택 (정수형 위치 인덱스를 활용)
print(sr['이름'],"\n") # '이름' 라벨을 가진 원소를 선택 (인덱스 이름을 활용)

# 여러 개의 원소를 선택 (인덱스 리스트 활용)
print(sr[[1, 2]],"\n") 
print(sr[['생년월일', '성별']],"\n")

# 여러 개의 원소를 선택 (인덱스 범위 지정)
print(sr[1 : 2],"\n") 
print(sr['생년월일' : '성별'],"\n")

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

영인

영인

생년월일    2010-05-01
성별               여
dtype: object

생년월일    2010-05-01
성별               여
dtype: object

생년월일    2010-05-01
dtype: object

생년월일    2010-05-01
성별               여
dtype: object

In [2]:
import pandas as ad
#dict은 열
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 
            'c3':[10,11,12], 'c4':[13,14,15]}

df = pd.DataFrame(dict_data)

print(type(df),"\n")
print(df,"\n")
print(df['c0'],"\n")
print(df[1:3],"\n")
print(df['c0'][2],"\n") #한 요소만 선택 [컬럼명][인덱스]

<class 'pandas.core.frame.DataFrame'>

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

0    1
1    2
2    3
Name: c0, dtype: int64

   c0  c1  c2  c3  c4
1   2   5   8  11  14
2   3   6   9  12  15

3

rename()은 특정 컬럼이나 열의 이름을 선택해서 바꿀 때 사용  
한번에 지정할 때는 index or columns = [  ]형식으로! 모든 컬럼 or 열의 이름을 다 적어줘야 실행됨

In [3]:
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']], 
index=['준서', '예은'], columns=['나이', '성별', '학교'])

print(df,"\n")
df.index=['학생1', '학생2']
df.columns=['연령', '남녀', '소속']
print(df,"\n")
print(df.index,"\n") 
print(df.columns,"\n")
df.rename(columns={'나이':'연령', '성별':'남녀', '학교':'소속'})
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

Index(['학생1', '학생2'], dtype='object')

Index(['연령', '남녀', '소속'], dtype='object')

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [4]:
df2 = df[:]
df2 = df2.drop("학생1")
df2

     연령 남녀   소속
학생2  17  여  수리중

In [5]:
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']], 
index=['준서', '예은'], columns=['나이', '성별', '학교'])

In [6]:
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
print(df)
print('\n')
# 데이터프레임 df를 복제하여 변수 df2에 저장. df2의 1개 행(row)을 삭제
df2 = df[:]
df2 = df2.drop('우현')
print(df2)
print('\n')
# 데이터프레임 df를 복제하여 변수 df3에 저장. df3의 2개 행(row)을 삭제
df3 = df[:]
df3 = df3.drop(['우현', '인아'])
print(df3)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90


    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90


    수학  영어  음악   체육
서준  90  98  85  100

### loc: 인덱스 이름, 범위의 끝까지 포함  
### iloc: 정수형 위치 인덱스, 범위의 끝 제외

In [7]:
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
label1 = df.loc['서준']
print(label1,"\n")
position1 = df.iloc[0]
print(position1,"\n")

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [8]:
exam_data = {'이름' : [ '서준', '우현', '인아'],
'수학' : [ 90, 80, 70],
'영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100],
'체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
# '이름' 열을 새로운 인덱스로 지정, df 객체에 변경사항 반영
df.set_index('이름', inplace=True)
print(df)
# 데이터프레임 df의 특정 원소 1개 선택 ('서준'의 '음악' 점수)
a = df.loc['서준', '음악']
print(a)
b = df.iloc[0, 2]
print(b)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
85
85

### 열 추가: df[컬럼명] = vlaue  
### axis = 1 은 컬럼을 삭제할 때 사용  
### inplace = True : 변경을 저장 => 재정의를 통해 안쓰고 해결 가능

In [9]:
df['국어'] = 80
print(df)
df2 = df.drop("국어",axis = 1)
df.drop("국어",axis = 1,inplace = True)
print(df2)
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80
    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

### 행 추가  
df.loc = [   ]

In [10]:
df.loc['동규'] = [85, 90, 100, 95]
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
동규  85  90  100   95

In [11]:
df['총점'] = df['수학'] + df['영어'] + df['음악'] + df['체육']
df['평균'] = df['총점'] / 4
grades = []
for row in df['평균']:
    if row >= 90:
        grades.append('합격')
    else:
        grades.append('불합격')
df['합격여부'] = grades
df

    수학  영어   음악   체육   총점     평균 합격여부
이름
서준  90  98   85  100  373  93.25   합격
우현  80  89   95   90  354  88.50  불합격
인아  70  95  100   90  355  88.75  불합격
동규  85  90  100   95  370  92.50   합격

### 행/열의 위치 바꾸기  
DataFrame 객체.transpose() or DataFrame 객체.T

In [12]:
df = df.transpose()
print(df)
print("\n")
df = df.transpose()
df

이름       서준    우현     인아    동규
수학       90    80     70    85
영어       98    89     95    90
음악       85    95    100   100
체육      100    90     90    95
총점      373   354    355   370
평균    93.25  88.5  88.75  92.5
합격여부     합격   불합격    불합격    합격

    수학  영어   음악   체육   총점     평균 합격여부
이름
서준  90  98   85  100  373  93.25   합격
우현  80  89   95   90  354   88.5  불합격
인아  70  95  100   90  355  88.75  불합격
동규  85  90  100   95  370   92.5   합격

In [13]:
def scholarship(row):
    print(row)
    if row == '합격':
        return '장학생'
    else:
        return '비장학생'

### apply가 앞의 컬럼 값을 함수의 아규먼트값으로 해주는듯?

In [14]:
df.합격여부 = df.합격여부.apply(scholarship)
print(df)
dft = df.rename(columns = {'합격여부':'장학생 여부'})
dft

합격
불합격
불합격
합격
    수학  영어   음악   체육   총점     평균  합격여부
이름
서준  90  98   85  100  373  93.25   장학생
우현  80  89   95   90  354   88.5  비장학생
인아  70  95  100   90  355  88.75  비장학생
동규  85  90  100   95  370   92.5   장학생

    수학  영어   음악   체육   총점     평균 장학생 여부
이름
서준  90  98   85  100  373  93.25    장학생
우현  80  89   95   90  354   88.5   비장학생
인아  70  95  100   90  355  88.75   비장학생
동규  85  90  100   95  370   92.5    장학생

### 데이터파일 입출력

In [15]:
df = pd.read_csv('./csv_sample.csv')
print(df,"\n")
df2 = pd.read_csv('./csv_sample.csv', index_col="c0")
print(df2)

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

    c1  c2  c3
c0
0    1   4   7
1    2   5   8
2    3   6   9

In [17]:
dft.to_csv("./TestDfToCsv")
dft.to_json("./TestDfToJson.json")
dft.to_excel("./TestDfToExcel.xlsx")